#!/bin/sh
#-----------------------------------------------------------------------------#
# =========                 |
# \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
#  \\    /   O peration     | Website:  https://github.com/StasF1
#   \\  /    A nd           | Version:  6
#    \\/     M anipulation  |
#------------------------------------------------------------------------------
# Script
#     hardResolve
#
# Description
#     Скрипт для перезапуска расчёта при использовании настроек из ../case
#
#-----------------------------------------------------------------------------# 

# Удаление cтарых результатов расчёта
rm -r 1
rm -r constant
rm -r system/fvSolution

# Перезапуск расчёта с копирование файлов сетки заново
sh firstSolve.sh 


# ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~
echo -ne '\007' # звуковой сигнал при выполнении задачи




